# __Missing Values__

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

### __Reading Data from CSV__

In [2]:
emp_data = pd.read_csv("data/Emp_data.csv")

# Adding NaN valuse to column - 3
for x in emp_data.iloc[:5:2, 3]:
    emp_data.iloc[:5:2, 3] = np.nan

# Making the float value to String
emp_data['Weight in Kgs'][1] = '60'

emp_data.head(3)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,NaN,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155,Michigantown

### __Changed dtype Float to Object__

In [3]:
emp_data['Weight in Kgs'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 100 entries, 0 to 99
Series name: Weight in Kgs
Non-Null Count  Dtype
--------------  -----
97 non-null     object
dtypes: object(1)
memory usage: 928.0+ bytes

### __Replacing _NaN_ to 0__

In [4]:
emp_data['Weight in Kgs'] = emp_data['Weight in Kgs'].replace(float('NaN'), 0)
emp_data.head(5)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,0,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,0,0.98,50155,Michigantown
3,408351,Diane,39.67,51.0,18.30,180294,Hydetown
4,193819,Benjamin,40.31,0,4.01,117642,Fremont

### __Converting all Weight values to int__

In [5]:
emp_data['Weight in Kgs'] = emp_data['Weight in Kgs'].apply(lambda x: int(x))

### __Missing Weight Values Replacing by mean()__

In [6]:
emp_data['Weight in Kgs'].replace(0, emp_data['Weight in Kgs'].mean(), inplace=True)
emp_data.head(5)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,56.22,13.68,168251,Denver
1,940761,Brenda,47.02,60.00,9.01,51063,Stonewall
2,428945,Joe,54.15,56.22,0.98,50155,Michigantown
3,408351,Diane,39.67,51.00,18.30,180294,Hydetown
4,193819,Benjamin,40.31,56.22,4.01,117642,Fremont

### __Converting all Weight values to int__

In [7]:
emp_data['Weight in Kgs'] = emp_data['Weight in Kgs'].astype(int)

In [8]:
emp_data

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,56,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,56,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,56,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

# __Encoding__

In [9]:
emp_data['Weight in Kgs'].unique().size

36

### __Type: _onehot encoding___

In [10]:
new_data = pd.get_dummies(emp_data, columns=["Weight in Kgs"], dtype=int)
new_data

,Emp ID,First Name,Age in Yrs,Age in Company,Salary,City,Weight in Kgs_40,Weight in Kgs_41,Weight in Kgs_42,Weight in Kgs_43,...,Weight in Kgs_73,Weight in Kgs_74,Weight in Kgs_75,Weight in Kgs_77,Weight in Kgs_80,Weight in Kgs_81,Weight in Kgs_82,Weight in Kgs_87,Weight in Kgs_89,Weight in Kgs_90
0,677509,Lois,36.36,13.68,168251,Denver,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,940761,Brenda,47.02,9.01,51063,Stonewall,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,428945,Joe,54.15,0.98,50155,Michigantown,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,408351,Diane,39.67,18.30,180294,Hydetown,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,193819,Benjamin,40.31,4.01,117642,Fremont,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,639892,Jose,22.82,1.05,129774,Biloxi,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
96,704709,Harold,32.61,5.93,156194,Carol Stream,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
97,461593,Nicole,52.66,28.53,95673,Detroit,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
98,392491,Theresa,29.60,6.99,51015,Mc Grath,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
99,495141,Tammy,38.38,2.26,93650,Alma,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [11]:
new_data.iloc[34:35:, ::]

,Emp ID,First Name,Age in Yrs,Age in Company,Salary,City,Weight in Kgs_40,Weight in Kgs_41,Weight in Kgs_42,Weight in Kgs_43,...,Weight in Kgs_73,Weight in Kgs_74,Weight in Kgs_75,Weight in Kgs_77,Weight in Kgs_80,Weight in Kgs_81,Weight in Kgs_82,Weight in Kgs_87,Weight in Kgs_89,Weight in Kgs_90
34,278556,Richard,24.02,0.94,122226,Ohatchee,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0

In [12]:
name_list=new_data.loc[new_data['Weight in Kgs_81']==True,'First Name'].tolist()
name_list

['Richard']

In [13]:
new_data[new_data["Weight in Kgs_90"]==1]

,Emp ID,First Name,Age in Yrs,Age in Company,Salary,City,Weight in Kgs_40,Weight in Kgs_41,Weight in Kgs_42,Weight in Kgs_43,...,Weight in Kgs_73,Weight in Kgs_74,Weight in Kgs_75,Weight in Kgs_77,Weight in Kgs_80,Weight in Kgs_81,Weight in Kgs_82,Weight in Kgs_87,Weight in Kgs_89,Weight in Kgs_90
38,726264,Carl,43.63,10.14,162159,Wright,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [14]:
new_data[new_data["Weight in Kgs_40"]==1]

,Emp ID,First Name,Age in Yrs,Age in Company,Salary,City,Weight in Kgs_40,Weight in Kgs_41,Weight in Kgs_42,Weight in Kgs_43,...,Weight in Kgs_73,Weight in Kgs_74,Weight in Kgs_75,Weight in Kgs_77,Weight in Kgs_80,Weight in Kgs_81,Weight in Kgs_82,Weight in Kgs_87,Weight in Kgs_89,Weight in Kgs_90
7,380086,Carol,59.12,34.52,60918,Blanchester,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
41,227922,Amanda,35.02,10.28,114257,Lake Charles,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
47,524896,Judy,56.38,5.59,133332,Topeka,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
75,765850,Linda,25.96,0.20,113256,Albion,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [15]:
new_data["Weight in Kgs_81"].value_counts()

Weight in Kgs_81
0    99
1     1
Name: count, dtype: int64